In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
df_aapl = pd.read_csv("C:/Users/lenovo/OneDrive - Hanoi University of Science and Technology/Desktop/Đồ án 2/Thực hành/extract/AAPL_2010_2025.csv")
df_fpt = pd.read_csv("C:/Users/lenovo/OneDrive - Hanoi University of Science and Technology/Desktop/Đồ án 2/Thực hành/extract/FPT_2010_2025.csv")

## Dữ liệu AAPL

### Đọc dữ liệu

In [ ]:
df_aapl.head(5)

         Date     Close      High       Low      Open     Volume
0  2010-01-04  7.643214  7.660714  7.585000  7.622500  493729600
1  2010-01-05  7.656429  7.699643  7.616071  7.664286  601904800
2  2010-01-06  7.534643  7.686786  7.526786  7.656429  552160000
3  2010-01-07  7.520714  7.571429  7.466071  7.562500  477131200
4  2010-01-08  7.570714  7.571429  7.466429  7.510714  447610800

In [ ]:
df_aapl.tail(5)

            Date       Close        High         Low        Open    Volume
4018  2025-12-23  272.359985  272.500000  269.559998  270.839996  29642000
4019  2025-12-24  273.809998  275.429993  272.200012  272.339996  17910600
4020  2025-12-26  273.399994  275.369995  272.859985  274.160004  21521800
4021  2025-12-29  273.760010  274.359985  272.350006  272.690002  23715200
4022  2025-12-30  273.079987  274.079987  272.279999  272.809998  22139600

In [ ]:
df_aapl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4023 entries, 0 to 4022
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    4023 non-null   object
 1   Close   4023 non-null   float64
 2   High    4023 non-null   float64
 3   Low     4023 non-null   float64
 4   Open    4023 non-null   float64
 5   Volume  4023 non-null   int64
dtypes: float64(4), int64(1), object(1)
memory usage: 188.7+ KB

In [ ]:
df_aapl.describe()

             Close         High          Low         Open        Volume
count  4023.000000  4023.000000  4023.000000  4023.000000  4.023000e+03
mean     79.807191    80.595954    78.943487    79.741681  2.190483e+08
std      74.654567    75.378274    73.849456    74.572538  2.154916e+08
min       6.858929     7.000000     6.794643     6.870357  1.791060e+07
25%      21.526785    21.671428    21.244108    21.447321  7.771080e+07
50%      41.310001    41.842499    40.842499    41.250000  1.308080e+08
75%     145.855003   147.209999   144.050003   145.480003  2.901486e+08
max     286.190002   288.619995   283.299988   286.200012  1.880998e+09

### Định dạng dữ liệu Thời gian về Date Time

In [ ]:
df_aapl["Date"] = pd.to_datetime(df_aapl["Date"])

### Kiểm tra dữ liệu thiếu, lặp

In [ ]:
missing_value = df_aapl.isnull().sum()
print("Tổng số dữ liệu thiếu:\n", missing_value)

Tổng số dữ liệu thiếu:
 Date      0
Close     0
High      0
Low       0
Open      0
Volume    0
dtype: int64

In [ ]:
duplicate = df_aapl.duplicated().sum()
print(f"Số bản ghi trùng lặp: {duplicate}")

Số bản ghi trùng lặp: 0

### Tính lợi nhuận Logarit

In [ ]:
df_aapl['Log_Return'] = np.log(df_aapl['Close'] / df_aapl['Close'].shift(1))

### Tính Volatility

In [ ]:
df_aapl['Volatility_20d'] = (
    df_aapl['Log_Return']
    .rolling(20)
    .std()
    * np.sqrt(252)
)

df_aapl['Volatility_60d'] = (
    df_aapl['Log_Return']
    .rolling(60)
    .std()
    * np.sqrt(252)
)

### Đầu ra

In [ ]:
df_aapl.tail()

,Date,Close,High,Low,Open,Volume,Log_Return,Volatility_20d,Volatility_60d
4018,2025-12-23,272.359985,272.500000,269.559998,270.839996,29642000,0.005117,0.124780,0.178421
4019,2025-12-24,273.809998,275.429993,272.200012,272.339996,17910600,0.005310,0.125607,0.178624
4020,2025-12-26,273.399994,275.369995,272.859985,274.160004,21521800,-0.001499,0.125243,0.178659
4021,2025-12-29,273.760010,274.359985,272.350006,272.690002,23715200,0.001316,0.123873,0.178302
4022,2025-12-30,273.079987,274.079987,272.279999,272.809998,22139600,-0.002487,0.108425,0.178374

## Dữ liệu cổ phiếu FPT

In [ ]:
df_fpt.head(5)

         Date        Close         High          Low         Open   Volume
0  2010-01-04  8527.893555  8527.893555  8166.104492  8372.840820  2279397
1  2010-01-05  8527.893555  8837.999023  8527.893555  8837.999023  1935195
2  2010-01-06  8372.840820  8631.261719  8217.788086  8527.893555   917767
3  2010-01-07  8321.157227  8424.525391  8269.472656  8372.840820   993704
4  2010-01-08  8062.735840  8476.208984  8062.735840  8476.208984  1562937

In [ ]:
df_fpt.tail(5)

            Date    Close     High      Low     Open   Volume
3984  2025-12-24  93600.0  94200.0  93100.0  94100.0  3972048
3985  2025-12-25  93000.0  94800.0  93000.0  93600.0  4897186
3986  2025-12-26  92500.0  93000.0  91000.0  92700.0  7754428
3987  2025-12-29  94300.0  94900.0  92500.0  92500.0  6376449
3988  2025-12-30  96500.0  96600.0  94300.0  94500.0  7567196

In [ ]:
df_fpt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3989 entries, 0 to 3988
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    3989 non-null   object
 1   Close   3989 non-null   float64
 2   High    3989 non-null   float64
 3   Low     3989 non-null   float64
 4   Open    3989 non-null   float64
 5   Volume  3989 non-null   int64
dtypes: float64(4), int64(1), object(1)
memory usage: 187.1+ KB

In [ ]:
df_fpt.describe()

,Close,High,Low,Open,Volume
count,3989.000000,3989.000000,3989.000000,3989.000000,3.989000e+03
mean,31921.196760,32266.424107,31593.203123,31923.775386,4.104159e+06
std,32635.571538,32986.366350,32300.427759,32644.729296,4.313909e+06
min,5564.651855,5616.335938,5530.195801,5547.423828,2.883400e+04
25%,9923.342773,9992.254883,9785.518555,9906.114258,1.671135e+06
50%,16032.148438,16195.909180,15932.254883,16048.524414,2.970278e+06
75%,51012.300781,51450.644531,50519.164062,51012.300781,5.278959e+06
max,134173.906250,135652.171875,133391.296875,134000.000000,1.056287e+08

### Định dạng dữ liệu Thời gian về Date Time

In [ ]:
df_fpt["Date"] = pd.to_datetime(df_fpt["Date"])

### Kiểm tra dữ liệu thiếu, lặp

In [ ]:
missing_value = df_fpt.isnull().sum()
print("Tổng số dữ liệu thiếu:\n", missing_value)

Tổng số dữ liệu thiếu:
 Date      0
Close     0
High      0
Low       0
Open      0
Volume    0
dtype: int64

In [ ]:
duplicate = df_fpt.duplicated().sum()
print(f"Số bản ghi trùng lặp: {duplicate}")

Số bản ghi trùng lặp: 0

### Tính lợi nhuận Logarit

In [ ]:
df_fpt['Log_Return'] = np.log(df_fpt['Close'] / df_fpt['Close'].shift(1))

### Tính Volatility

In [ ]:
df_fpt['Volatility_20d'] = (
    df_fpt['Log_Return']
    .rolling(20)
    .std()
    * np.sqrt(252)
)

df_fpt['Volatility_60d'] = (
    df_fpt['Log_Return']
    .rolling(60)
    .std()
    * np.sqrt(252)
)

### Đầu ra

In [ ]:
df_fpt.tail()

,Date,Close,High,Low,Open,Volume,Log_Return,Volatility_20d,Volatility_60d
3984,2025-12-24,93600.0,94200.0,93100.0,94100.0,3972048,-0.004264,0.177174,0.311511
3985,2025-12-25,93000.0,94800.0,93000.0,93600.0,4897186,-0.006431,0.175106,0.310435
3986,2025-12-26,92500.0,93000.0,91000.0,92700.0,7754428,-0.005391,0.156861,0.309282
3987,2025-12-29,94300.0,94900.0,92500.0,92500.0,6376449,0.019273,0.174227,0.308424
3988,2025-12-30,96500.0,96600.0,94300.0,94500.0,7567196,0.023062,0.194406,0.312090

## Xuất file Dữ liệu

### AAPL

In [ ]:
df_aapl.to_csv("C:/Users/lenovo/OneDrive - Hanoi University of Science and Technology/Desktop/Đồ án 2/Thực hành/etl/AAPL_10year.csv", encoding='utf-8',index=False)

### FPT

In [ ]:
df_fpt.to_csv("C:/Users/lenovo/OneDrive - Hanoi University of Science and Technology/Desktop/Đồ án 2/Thực hành/etl/FPT_10year.csv", encoding='utf-8',index=False)